{
  "backend/main.mo": "Main Motoko actor implementing the backend with access-controlled user profiles, blog post CRUD (admin-only writes, public reads), and portfolio item management using stable maps and Internet Identity-based authorization.",
  "feature_evidence.json": "Feature evidence report mapping two auth-related features (Login/Logout nav button with admin controls, and admin page access protection) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "Truncated JSON document containing short summaries of all frontend source files, describing each component, page, hook, and style file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'The Rural Wellness Journal', mounting the app at the root div and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all page routes (Home, Blog, Portfolio, About, Admin), wraps them in a Layout, and conditionally shows the ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Reusable access-denied UI component that shows either a 'Login Required' screen with an Internet Identity login button or an 'Access Denied' screen for unauthorized users, with configurable back navigation.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog prompting newly authenticated users to enter their name for profile setup, submitting via the saveCallerUserProfile mutation and blocking dismissal until saved.",
  "frontend/src/components/blog/BlogPostCard.tsx": "Renders a blog post card with title, excerpt, category badge, and date; includes admin-only edit and delete controls with a confirmation dialog.",
  "frontend/src/components/blog/CategoryBadge.tsx": "Displays a styled badge for a blog post category (Personal Story, Interview, or Clinical Observation) with configurable size.",
  "frontend/src/components/blog/CreateBlogPostForm.tsx": "Form for creating a new blog post with fields for title, category, content, and optional featured image URL, using react-hook-form and a create mutation.",
  "frontend/src/components/common/ImagePlaceholder.tsx": "Renders a styled dashed placeholder box with an icon and label, supporting 'field' and 'portrait' variants and multiple aspect ratios.",
  "frontend/src/components/layout/Footer.tsx": "Site footer displaying the brand name, description, navigation links, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps all pages with a sticky Navigation header, a main content outlet, and a Footer.",
  "frontend/src/components/layout/Navigation.tsx": "Sticky top navigation bar with links for main pages, admin-only links for creating content, and an Internet Identity login/logout button with mobile menu support.",
  "frontend/src/components/portfolio/CreatePortfolioForm.tsx": "Form for creating a portfolio photo essay with title, description, location, and a dynamic list of image URLs, using react-hook-form and a create mutation.",
  "frontend/src/components/portfolio/PortfolioCard.tsx": "Renders a portfolio item card with cover image, title, and location, and shows admin-only edit/delete controls (with a confirmation dialog) on hover.",
  "frontend/src/components/portfolio/PortfolioLightbox.tsx": "Displays a full-screen modal lightbox for a portfolio item, supporting multi-image navigation via keyboard and buttons, with a fallback placeholder when no images exist.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend operations including user profiles, admin checks, blog posts (CRUD), and portfolio items (CRUD), each wired to the actor from useActor.",
  "frontend/src/index.css": "Defines global styles including Google Fonts imports, Tailwind directives, and a warm earth-tone CSS custom property palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a hero banner, author portrait placeholder, info card (education, location, mission), and a biographical narrative about the journal's creator and purpose.",
  "frontend/src/pages/AdminBlogPage.tsx": "Admin-only page for creating a new blog post; guards access by checking authentication and admin status, showing appropriate error screens or a loading skeleton before rendering the CreateBlogPostForm.",
  "frontend/src/pages/AdminPortfolioPage.tsx": "Admin-only page for adding a new photo essay to the portfolio; mirrors AdminBlogPage's auth/admin guard pattern and renders CreatePortfolioForm on success.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with full content, and provides admins with inline edit (react-hook-form) and delete (AlertDialog) capabilities, navigating back to the blog list on deletion.",
  "frontend/src/pages/BlogListingPage.tsx": "Lists all blog posts in a filterable grid by category (Personal Story, Interview, Clinical Observation), with loading skeletons and an admin shortcut to navigate to a post's edit view.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section, a three-column mission strip, and a grid of the three most recent blog posts, with navigation buttons to the blog and portfolio sections.",
  "frontend/src/pages/PortfolioPage.tsx": "React page that displays portfolio items in a grid with lightbox support, and provides an inline edit form (title, description, location, image URLs) for admin users using react-hook-form and a custom update mutation hook.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode, registers content paths, extends the theme with custom fonts (Lora/Inter), OKLCH-based color tokens (terracotta, sage, cream, etc.), custom shadows, and animation keyframes, while loading the typography, container-queries, and animate plugins.",
  "project_state.json": "JSON file tracking the overall project state (version 7) for 'The Rural Wellness Journal', including a summary, architectural notes, known issues, and a list of existing implemented features covering the blog, portfolio, about page, and admin authentication."
}